verification/runs/F3_runs/diamond/M2.5_eps5/medium/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.4000000000 0.0000000000 -0.0050000000)
    (0.0000000000 0.0000000000 -0.0050000000)
    (0.5000000000 0.0437443318 -0.0050000000)
    (1.0000000000 0.0000000000 -0.0050000000)
    (1.6000000000 0.0000000000 -0.0050000000)
    (-0.4000000000 0.5000000000 -0.0050000000)
    (0.0000000000 0.5000000000 -0.0050000000)
    (0.5000000000 0.5000000000 -0.0050000000)
    (1.0000000000 0.5000000000 -0.0050000000)
    (1.6000000000 0.5000000000 -0.0050000000)
    (-0.4000000000 0.0000000000 0.0050000000)
    (0.0000000000 0.0000000000 0.0050000000)
    (0.5000000000 0.0437443318 0.0050000000)
    (1.0000000000 0.0000000000 0.0050000000)
    (1.6000000000 0.0000000000 0.0050000000)
    (-0.4000000000 0.5000000000 0.0050000000)
    (0.0000000000 0.5000000000 0.0050000000)
    (0.5000000000 0.5000000000 0.0050000000)
    (1.0000000000 0.5000000000 0.0050000000)
    (1.6000000000 0.5000000000 0.0050000000)
);

blocks
(
    
hex (0 1 6 5 10 11 16 15) (40 40 1) simpleGrading (1 1 1)    hex (1 2 7 6 11 12 17 16) (60 40 1) simpleGrading (1 1 1)    hex (2 3 8 7 12 13 18 17) (60 40 1) simpleGrading (1 1 1)    hex (3 4 9 8 13 14 19 18) (40 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 10 15 5));
    }
    outlet
    {
        type patch;
        faces ((4 9 19 14));
    }
    bottom
    {
        type symmetryPlane;
        faces ((0 1 11 10)(3 4 14 13));
    }
    top
    {
        type patch;
        faces ((5 15 16 6)(6 16 17 7)
               (7 17 18 8)(8 18 19 9));
    }
    obstacle
    {
        type wall;
        faces ((1 2 12 11)(2 3 13 12));
    }
    defaultFaces
    {
        type empty;
        faces ();
    }
);

mergePatchPairs
(
);
